Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: However, HTTP/1.0 does not sufficiently take into consideration the effects of hierarchical proxies, caching, the need for persistent connections, or virtual hosts.
zh_cn: 但是，HTTP/1.0 没有充分考虑分层代理，缓存，持久连接需求或虚拟主机的影响。

source: However, POST caching is not widely implemented.
zh_cn: 但是，POST 缓存并未广泛实现。

source: However, RxJava's reactive types are immutable; each of the method calls returns a new `Flowable` with added behavior.
zh_cn: 但是，RxJava 的反应类型是不可变的；每个方法调用都返回一个带有添加行为的新的 `Flowable`。

source: However, TLS 1.3 servers might receive ClientHello messages without an extensions field from prior versions of TLS.
zh_cn: 但是，TLS 1.3 服务器可能会接收到不带扩展字段的 ClientHello 消息，这些消息来自以前版本的 TLS。

source: However, URI comparison implementations do not always perform normalization prior to comparison (see Section 6).
zh_cn: 但是，URI 比较实现并不总是在比较之前执行规范化(参见第 6 节)。

source: However, a client MUST understand the class of any status code, as indicated by the first digit, and treat an unrecognized status code as being equivalent to the x00 status code of that class, with the exception that a recipient MUST NOT cache a response with an unrecognized status code.
zh_cn: 但是，客户端必须理解任何状态代码的类，如第一个数字所示，并将无法识别的状态代码视为等同于该类的 x00 状态代码，但接收者不得缓存响应无法识别的状态代码。

source: However, a globally scoped naming system, such as DNS fully qualified domain names, is necessary for URIs intended to have global scope.
zh_cn: 但是，对于具有全局范围的 URI，必须使用全局范围的命名系统，例如 DNS 完全限定的域名。

source: However, an HTTP-to-HTTP gateway that wishes to interoperate with third-party HTTP servers ought to conform to user agent requirements on the gateway's inbound connection.
zh_cn: 但是，希望与第三方 HTTP 服务器进行互操作的 HTTP 到 HTTP 网关应该符合网关入站连接上的用户代理要求。

source: However, an action made on the basis of that reference will take place in relation to the end-user's context, which implies that an action intended to refer to a globally unique thing must use a URI that distinguishes that resource from all other things.
zh_cn: 但是，基于该引用而做出的动作将与最终用户的上下文相关联，这意味着旨在引用全局唯一事物的动作必须使用区分该资源与所有其他事物的 URI。

source: However, an extension to HTTP that is defined to apply to entire host domains, such as the Cookie protocol [RFC6265], can allow information set by one service to impact communication with other services within a matching group of host domains.
zh_cn: 但是，定义为应用于整个主机域的 HTTP 扩展(例如 Cookie 协议 [RFC6265])可以允许一个服务设置的信息影响与匹配的主机域组内的其他服务的通信。

source: However, applications MUST understand the class of any status code, as indicated by the first digit, and treat any unrecognized response as being equivalent to the x00 status code of that class, with the exception that an unrecognized response MUST NOT be cached.
zh_cn: 但是，应用程序必须理解任何状态代码的类，如第一个数字所示，并将任何无法识别的响应视为等同于该类的 x00 状态代码，但不得缓存无法识别的响应。

source: However, as URI identification and usage have become commonplace, traditional media (television, radio, newspapers, billboards, etc.) have increasingly used a suffix of the URI as a reference, consisting of only the authority and path portions of the URI, such as www.w3.org/Addressing/ or simply a DNS registered name on its own.
zh_cn: 然而，随着 URI 识别和使用变得普遍，传统媒体(电视，广播，报纸，广告牌等)越来越多地使用 URI 的后缀作为参考，仅由 URI 的权限和路径部分组成，例如如 www.w3.org/Addressing/或仅仅是 DNS 注册名称。

source: However, as query components are often used to carry identifying information in the form of "key=value" pairs and one frequently used value is a reference to another URI, it is sometimes better for usability to avoid percent-encoding those characters.
zh_cn: 但是，由于查询组件通常用于携带“key=value”对形式的标识信息，而一个常用值是对另一个 URI 的引用，因此有时避免对这些字符进行百分比编码对于可用性更好。

source: However, backpressure is present more subtly in regular cold sequences (which don't and shouldn't yield `MissingBackpressureException`).
zh_cn: 然而，背压在常规冷序列中更微妙地存在(它不会也不应该产生 `MissingBackpressureException`)。

source: However, each connection consumes server resources.
zh_cn: 但是，每个连接都会占用服务器资源。

source: However, even if clients do offer it, the rules specified in [TLSEXT] require servers to ignore extensions they do not understand.
zh_cn: 但是，即使客户端提供它，[TLSEXT] 中指定的规则也要求服务器忽略它们不理解的扩展。

source: However, even when the receive window is zero, a TCP must process the RST and URG fields of all incoming segments.
zh_cn: 但是，即使接收窗口为零，TCP 也必须处理所有传入报文段的 RST 和 URG 字报文段。

source: However, for convenience we discuss "HelloRetryRequest" throughout this document as if it were a distinct message.
zh_cn: 但是，为方便起见，我们在整个文档中讨论“HelloRetryRequest”，就好像它是一个不同的消息。

source: However, for maximal compatibility with earlier versions of TLS, this specification uses the RSAES-PKCS1-v1_5 scheme.
zh_cn: 但是，为了与早期版本的 TLS 最大程度地兼容，本规范使用 RSAES-PKCS1-v1_5 方案。

source: However, half-open connections are expected to be unusual, and the recovery procedure is mildly involved.
zh_cn: 但是，预计半开连接是不寻常的，并且恢复过程涉及到温和。

source: However, if the source Observable terminates with an error, the AsyncSubject will not emit any items, but will simply pass along the error notification from the source Observable.
zh_cn: 但是，如果源 Observable 以错误终止，则 AsyncSubject 将不会发射任何项，而只会传递来自源 Observable 的错误通知。

source: However, if the source Observable terminates with an error, the BehaviorSubject will not emit any items to subsequent observers, but will simply pass along the error notification from the source Observable.
zh_cn: 但是，如果源 Observable 以错误终止，则 BehaviorSubject 将不会向后续观察者发射任何项，而只会传递来自源 Observable 的错误通知。

source: However, immediately after sending the 101 (Switching Protocols) response, the server is expected to continue responding to the original request as if it had received its equivalent within the new protocol (i.e., the server still has an outstanding request to satisfy after the protocol has been changed, and is expected to do so without requiring the request to be repeated).
zh_cn: 但是，在发送 101(交换协议)响应之后，服务器应该立即继续响应原始请求，就好像它已经在新协议中接收到它的等价物一样(即，服务器仍然有一个未完成的请求在协议之后满足已被更改，并且预计会这样做而不要求重复请求)。

source: However, increased use of HTTP for sensitive applications has required security measures.
zh_cn: 但是，敏感应用程序使用 HTTP 的增加需要采取安全措施。

source: However, it is "good practice" to send general-header fields first, followed by request-header or response- header fields, and ending with the entity-header fields.
zh_cn: 但是，首先发送常规首部字段，然后发送请求首部或响应首部字段，最后发送实体首部字段是“良好实践”。

source: However, it is good practice to send header fields that contain control data first, such as Host on requests and Date on responses, so that implementations can decide when not to handle a message as early as possible.
zh_cn: 但是，优良作法是首先发送包含控制数据的首部字段，例如请求上的 Host 和响应上的 Date，以便实现可以尽早决定何时不处理消息。

source: However, it is possible that a sequence of several requests is non- idempotent, even if all of the methods executed in that sequence are idempotent.
zh_cn: 但是，有可能多个请求的序列是非等幂的，即使在该序列中执行的所有方法都是等幂的。

source: However, lenient parsing can result in security vulnerabilities if there are multiple recipients of the message and each has its own unique interpretation of robustness (see Section 9.5).
zh_cn: 但是，如果消息有多个接收者，并且每个消息都有自己独特的健壮性解释，那么宽松的解析可能会导致安全漏洞(参见第 9.5 节)。

source: However, most HTTP clients rely on the same resource identification mechanism and configuration techniques as general-purpose Web browsers.
zh_cn: 但是，大多数 HTTP 客户端依赖于与通用 Web 浏览器相同的资源识别机制和配置技术。

source: However, most origin servers do not implement CONNECT.
zh_cn: 但是，大多数源服务器都不实现 CONNECT。

source: However, new or experimental header fields MAY be given the semantics of request- header fields if all parties in the communication recognize them to be request-header fields.
zh_cn: 但是，如果通信中的所有各方都认为它们是请求首部字段，则可以给新的或实验的首部字段赋予请求首部字段的语义。

source: However, new or experimental header fields MAY be given the semantics of response- header fields if all parties in the communication recognize them to be response-header fields.
zh_cn: 但是，如果通信中的所有各方都认为它们是响应首部字段，则可以给新的或实验的首部字段赋予响应首部字段的语义。

source: However, new or experimental header fields may be given the semantics of general header fields if all parties in the communication recognize them to be general-header fields.
zh_cn: 然而，如果通信中的所有各方将它们识别为通用报首部字段，则可以给新的或实验的报首部字段赋予通用报首部字段的语义。

source: However, once the ChangeCipherSpec has been sent, the new CipherSpec MUST be used.
zh_cn: 但是，一旦发送了 ChangeCipherSpec，就必须使用新的 CipherSpec。

source: However, recipients cannot rely on incremental delivery of partial messages, since some implementations will buffer or delay message forwarding for the sake of network efficiency, security checks, or payload transformations.
zh_cn: 但是，接收者不能依赖于部分消息的增量传递，因为一些实现将缓冲或延迟消息转发，以便进行网络效率，安全检查或有效载荷转换。

source: However, records MUST be delivered to the network in the same order as they are protected by the record layer.
zh_cn: 但是，记录必须以与记录层保护的顺序相同的顺序传送到网络。

source: However, safe transport has a different focus for an 8bit-clean transfer protocol.
zh_cn: 但是，安全传输对于 8 位清洁传输协议有不同的侧重点。

source: However, scheme specifications are encouraged to include a wide range of examples, including examples that show use of the scheme's URIs with fragment identifiers when such usage is appropriate.
zh_cn: 但是，鼓励方案规范包括各种示例，包括在适当使用时显示使用带有片段标识符的方案的 URI 的示例。

source: However, since multiple clients might act in parallel and perhaps at cross-purposes, we cannot require that such changes be observable beyond the scope of a single response.
zh_cn: 但是，由于多个客户端可能并行运行，并且可能是交叉目的，因此我们不能要求在单个响应的范围之外可以观察到此类更改。

source: However, some extensions may specify different behavior during session resumption.
zh_cn: 但是，某些扩展可能会在会话恢复期间指定不同的行为。

source: However, such use comes with its own costs: domain name ownership may change over time for reasons not anticipated by the URI producer.
zh_cn: 但是，此类使用需要自己承担费用：域名所有权可能会因 URI 生产者未预料到的原因而发生变化。

source: However, the 303 (See Other) response can be used to direct the user agent to retrieve a cacheable resource.
zh_cn: 但是，303(请参阅其他)响应可用于指示用户代理检索可缓存资源。

source: However, the client MUST ignore and skip any unrecognized certificate extension OIDs.
zh_cn: 但是，客户端必须忽略并跳过任何无法识别的证书扩展 OID。

source: However, the definition associated with a MIME character set name MUST fully specify the mapping to be performed from octets to characters.
zh_cn: 但是，与 MIME 字符集名称关联的定义必须完全指定要从八位字节到字符执行的映射。

source: However, the following will call since the `take` operator cancels after the set amount of `onNext` events have been delivered:
zh_cn: 但是，以下内容将调用，因为 `take` 操作符在已经传递了 `onNext` 事件的设定数量后取消：

source: However, the lambda `v -> v * v` doesn't run in parallel for this flow; it receives the values 1 to 10 on the same computation thread one after the other.
zh_cn: 但是，lambda `v -> v * v` 不会并行运行；它一个接一个地在同一个计算线程上接收值 1 到 10。

source: However, the minor version was not incremented for the changes introduced between [RFC2068] and [RFC2616], and this revision has specifically avoided any such changes to the protocol.
zh_cn: 但是，对于 [RFC2068] 和 [RFC2616] 之间引入的更改，次要版本没有增加，并且此修订版特别避免了对协议的任何此类更改。

source: However, the old semantics did not constrain the signing curve.
zh_cn: 但是，旧的语义并没有限制签名曲线。

source: However, the producing thread with the for loop can't know this and keeps `onNext`ing.
zh_cn: 但是，带有 for 循环的生产线程无法知道这一点，并保持调用 `onNext`。

source: However, the server SHOULD NOT indicate success unless, at the time the response is given, it intends to delete the resource or move it to an inaccessible location.
zh_cn: 但是，服务器不应该指示成功，除非在给出响应时，它打算删除资源或将其移动到不可访问的位置。

source: However, the set of allowed methods can change dynamically.
zh_cn: 但是，允许的方法集可以动态更改。

source: However, the values MAY be a non-contiguous subset of the "supported_groups" extension and MAY omit the most preferred groups.
zh_cn: 但是，值可以是“supported_groups”扩展的非连续子集，并且可以省略最优选的组。

source: However, there are no such limitations in practice.
zh_cn: 但是，在实践中没有这样的限制。

source: However, there is no guarantee that such a state change will be observable, since the target resource might be acted upon by other user agents in parallel, or might be subject to dynamic processing by the origin server, before any subsequent GET is received.
zh_cn: 但是，不能保证这样的状态改变是可观察的，因为目标资源可能被其他用户代理并行地操作，或者在接收到任何后续 GET 之前可能受到源服务器的动态处理。

source: However, this document does not deprecate SHA-1 in HMAC for record protection.
zh_cn: 但是，本文档不会弃用 HMAC 中用于进行记录保护的 SHA-1。

source: However, this is not true for `onStart`.
zh_cn: 但是，对于 `onStart` 来说，情况并非如此。

source: However, this requirement is not be construed as preventing a server from defending itself against denial-of-service attacks, or from badly broken client implementations.
zh_cn: 然而，这一要求并不能被解释为阻止服务器防御拒绝服务攻击或严重破坏的客户机实现。

source: However, unlike in a file system, these dot-segments are only interpreted within the URI path hierarchy and are removed as part of the resolution process (Section 5.2).
zh_cn: 但是，与文件系统不同，这些点段仅在 URI 路径层次结构中进行解释，并作为解析过程的一部分被删除(第 5.2 节)。

source: I want an Observable that does not start emitting items to subscribers until asked
zh_cn: 我想要一个 Observable，直到被问到才开始向订阅者发送项目

source: I want an Observable that will notify observers of an error
zh_cn: 我想要一个 Observable 来通知观察者一个错误

source: I want an Observable to invoke a particular action when certain events occur
zh_cn: 我希望 Observable 在发生某些事件时调用特定的操作

source: I want an Observable to recover gracefully
zh_cn: 我希望 Observable 能够优雅地恢复

source: I want an operator to operate on a particular Scheduler
zh_cn: 我希望操作符在特定的 Scheduler 上操作

source: I want to collect items from an Observable and reemit them as buffers of items
zh_cn: 我想从 Observable 收集项目并将它们重新作为项目的缓冲区重新提交

source: I want to convert the entire sequence of items emitted by an Observable into some other data structure
zh_cn: 我想将 Observable 发射的整个项目序列转换为其他一些数据结构

source: I want to create a new Observable
zh_cn: 我想创建一个新 Observable

source: I want to create a resource that has the same lifespan as the Observable
zh_cn: 我想创建一个与 Observable 具有相同生命周期的资源

source: I want to create an Observable by combining other Observables
zh_cn: 我想通过组合其他 Observable 来创建一个 Observable

source: I want to emit the items from an Observable after transforming them
zh_cn: 我希望在转换后从 Observable 中发射项目

source: I want to evaluate the entire sequence of items emitted by an Observable
zh_cn: 我想计算 Observable 发射的整个项目序列

source: I want to ignore all items emitted by an Observable and only pass along its completed/error notification
zh_cn: 我想忽略 Observable 发射的所有项目，只传递完成/错误通知

source: I want to mirror an Observable but prefix items to its sequence
zh_cn: 我想镜像 Observable 仅要它的序列前缀项

source: I want to reemit items from an Observable only on condition that it was the first of a collection of Observables to emit an item
zh_cn: 我想重新发射 Observable 中的项目，条件是它是 Observables 的第一个发射项目的条件

source: I want to reemit only certain items from an Observable
zh_cn: 我想仅重新提交 Observable 中的某些项目

source: I want to retrieve a particular item emitted by an Observable:
zh_cn: 我想检索一个 Observable 发射的特定项目：

source: I want to shift the items emitted by an Observable forward in time before reemitting them
zh_cn: 我希望在重新发送之前向前移动 Observable 发射的项目

source: I want to split one Observable into multiple Observables
zh_cn: 我想将一个 Observable 拆分成多个 Observable

source: I want to subscribe to an Observable and receive a Future that blocks until the Observable completes
zh_cn: 我想订阅一个 Observable 并接收一个阻塞的 Future，直到 Observable 完成

source: I want to transform items and notifications from an Observable into items and reemit them
zh_cn: 我想将来自 Observable 的项目 和 通知转换为项目并重新发送它们

source: I.e.,
zh_cn: 即，

source: IANA Considerations
zh_cn: IANA 注意事项

source: IANA has updated these to reference this document.
zh_cn: IANA 已经更新了这些引用此文件。

source: IMPORTANT NOTE: The security properties for 0-RTT data are weaker than those for other kinds of TLS data.
zh_cn: 重要说明：0-RTT 数据的安全属性弱于其他类型的 TLS 数据。

source: INTRODUCTION
zh_cn: 介绍

source: IRS - initial receive sequence number
zh_cn: IRS - 初始接收序列号

source: ISS - initial send sequence number
zh_cn: ISS - 初始发送序列号

source: ITU-T X.680 | ISO/IEC 8824-1 specifies that the tag of a type defined using the CHOICE keyword takes the value of the tag of the type from which the chosen data value is taken.
zh_cn: ITU-T X.680 | ISO/IEC 8824-1 规定使用 CHOICE 关键字定义的类型的标记采用从中获取所选数据值的类型的标记的值。

source: ITU-T X.681 | ISO/IEC 8824-2, 14.2 and 14.4, specifies that the tag of a type defined using "ObjectClassFieldType" is indeterminate if it is a type field, a variable-type value field, or a variable-type value set field.
zh_cn: ITU-T X.681 | ISO/IEC 8824-2,14.2 和 14.4 规定，如果类型字段，变量类型值字段或变量类型值集字段，使用“ObjectClassFieldType”定义的类型的标记是不确定的。

source: Idempotent Methods
zh_cn: 幂等方法

source: Idempotent methods (Section 4.2.2 of [RFC7231]) are significant to pipelining because they can be automatically retried after a connection failure.
zh_cn: 幂等方法([RFC7231] 的第 4.2.2 节)对流水线操作很重要，因为它们可以在连接失败后自动重试。

source: Idempotent methods are distinguished because the request can be repeated automatically if a communication failure occurs before the client is able to read the server's response.
zh_cn: 幂等方法是有区别的，因为如果在客户端能够读取服务器响应之前发生通信故障，则可以自动重复请求。

source: Identification
zh_cn: 鉴别

source: Identifier octets
zh_cn: 标识符八位字节

source: Identifying Data
zh_cn: 识别数据

source: Identifying a Target Resource
zh_cn: 识别目标资源

source: Identifying the source and reason for these exceptions can be tiresome, especially if they originate from a source and get routed to `RxJavaPlugins.onError` somewhere lower the chain.
zh_cn: 识别这些异常的来源和原因可能很烦人，特别是如果它们来自一个源并且在链的某个地方被路由到 `RxJavaPlugins.onError`。

source: If (EC)DHE key establishment is in use, then the ServerHello contains a "key_share" extension with the server's ephemeral Diffie-Hellman share; the server's share MUST be in the same group as one of the client's shares.
zh_cn: 如果正在使用 (EC)DHE 密钥建立，那么 ServerHello 包含一个“key_share”扩展，其中包含服务器的临时 Diffie-Hellman 共享；服务器的共享必须与客户端的一个共享在同一组中。

source: If ClientHello.client_version is TLS 1.1 or higher, server implementations MUST check the version number as described in the note below.
zh_cn: 如果 ClientHello.client_version 是 TLS 1.1 或更高版本，则服务器实现必须检查版本号，如下面的注释中所述。

source: If PSK is not being used, then (EC)DHE and certificate-based authentication are always used.
zh_cn: 如果未使用 PSK，则始终使用 (EC)DHE 和基于证书的身份验证。

source: If PSK key establishment is in use, then the ServerHello contains a "pre_shared_key" extension indicating which of the client's offered PSKs was selected.
zh_cn: 如果正在使用 PSK 密钥建立，则 ServerHello 包含一个“pre_shared_key”扩展，指示选择了客户端提供的哪个 PSK。

source: If RSA is being used for key agreement and authentication, the client generates a 48-byte premaster secret, encrypts it using the public key from the server's certificate, and sends the result in an encrypted premaster secret message.
zh_cn: 如果 RSA 用于密钥协商和身份验证，则客户端生成 48 字节的预主密钥，使用服务器证书中的公钥对其进行加密，并将结果发送到加密的预主密钥消息中。

source: If Request-URI is an absoluteURI, the host is part of the Request-URI.
zh_cn: 如果 Request-URI 是 absoluteURI，host 是 Request-URI 的一部分。

source: If SYN is present the sequence number is the initial sequence number (ISN) and the first data octet is ISN+1.
zh_cn: 如果存在 SYN，则序列号是初始序列号(ISN)，第一个数据八位字节是 ISN + 1。

source: If TLS 1.2 is negotiated, implementations MUST be prepared to accept a signature that uses any curve that they advertised in the "supported_groups" extension.
zh_cn: 如果协商了 TLS 1.2，则必须准备实现以接受使用它们在“supported_groups”扩展中公布的任何曲线的签名。

source: If a TLS 1.3 ClientHello is received with any other value in this field, the server MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 如果收到的 TLS 1.3 ClientHello 在此字段中有任何其他值，则服务器必须使用“illegal_parameter”警报中止握手。

source: If a TLS implementation receives an unexpected record type, it MUST send an unexpected_message alert.
zh_cn: 如果 TLS 实现收到意外的记录类型，它必须发送 unexpected_message 警报。

source: If a TLS implementation receives an unexpected record type, it MUST terminate the connection with an "unexpected_message" alert.
zh_cn: 如果 TLS 实现收到意外的记录类型，它必须使用“unexpected_message”警报终止连接。

source: If a TLS implementation would need to wrap a sequence number, it must renegotiate instead.
zh_cn: 如果 TLS 实现需要回转重用序列号，则必须重新协商。

source: If a Transfer-Encoding header field is present and the chunked transfer coding (Section 4.1) is the final encoding, the message body length is determined by reading and decoding the chunked data until the transfer coding indicates the data is complete.
zh_cn: 如果存在传输编码首部字段并且分块传输编码(部分 4.1)是最终编码，则通过读取和解码分块数据来确定消息体长度，直到传输编码指示数据完成为止。

source: If a Transfer-Encoding header field is present in a request and the chunked transfer coding is not the final encoding, the message body length cannot be determined reliably; the server MUST respond with the 400 (Bad Request) status code and then close the connection.
zh_cn: 如果请求中存在 Transfer-Encoding 首部字段并且分块传输编码不是最终编码，则不能可靠地确定消息体长度；服务器必须使用 400(错误请求)状态代码进行响应，然后关闭连接。

source: If a Transfer-Encoding header field is present in a response and the chunked transfer coding is not the final encoding, the message body length is determined by reading the connection until it is closed by the server.
zh_cn: 如果响应中存在 Transfer-Encoding 首部字段并且分块传输编码不是最终编码，则通过读取连接来确定消息体长度，直到服务器关闭它为止。

source: If a URI containing an IP-literal that starts with "v" (case-insensitive), indicating that the version flag is present, is dereferenced by an application that does not know the meaning of that version flag, then the application should return an appropriate error for "address mechanism not supported".
zh_cn: 如果包含以“v”（不区分大小写）开头的 IP 文本的 URI（表示存在版本标志）被不知道该版本标志含义的应用程序取消引用，则应用程序应返回“不支持地址机制”的相应错误。

source: If a URI contains an authority component, then the path component must either be empty or begin with a slash ("/") character.
zh_cn: 如果 URI 包含权限组件，则路径组件必须为空或以斜杠(“/”)字符开头。

source: If a URI does not contain an authority component, then the path cannot begin with two slash characters ("//").
zh_cn: 如果 URI 不包含权限组件，则路径不能以两个斜杠字符(“//”)开头。

source: If a client does not send a signature_algorithms extension, then the server MUST abort the handshake and send a handshake_failure alert.
zh_cn: 如果客户端没有发送 signature_algorithms 扩展，那么服务器必须中止握手并发送 handshake_failure 警报。

source: If a client does such a retry, it MUST NOT pipeline before it knows the connection is persistent.
zh_cn: 如果客户端进行了这样的重试，它必须在它知道连接是持久的之前才进行流水线传输。

source: If a client or server does not detect the other side's close promptly it could cause unnecessary resource drain on the network.
zh_cn: 如果客户端或服务器没有及时检测到另一方的关闭，则可能导致网络上不必要的资源消耗。

source: If a client receives a second HelloRetryRequest in the same connection (i.e., where the ClientHello was itself in response to a HelloRetryRequest), it MUST abort the handshake with an "unexpected_message" alert.
zh_cn: 如果客户端在同一连接中接收到第二个 HelloRetryRequest(即 ClientHello 本身响应 HelloRetryRequest 的情况)，它必须使用“unexpected_message”警报中止握手。

source: If a client receives an extension type in ServerHello that it did not request in the associated ClientHello, it MUST abort the handshake with an unsupported_extension fatal alert.
zh_cn: 如果客户端在 ServerHello 中收到它未在关联的 ClientHello 中请求的扩展类型，则它必须使用 unsupported_extension 致命警报中止握手。

source: If a custom class implementing `Subscriber` was employed before, subscribing it to a `Flowable` adds an internal wrapper that ensures observing the Flowable is 100% compliant with the specification at the cost of some per-item overhead.
zh_cn: 如果之前使用了实现 `Subscriber` 的自定义类，则将它订阅到 `Flowable` 会添加一个内部包装器，以确保观察 Flowable 100% 符合规范，代价是每个项目的开销。

source: If a given secret is not available, then the 0-value consisting of a string of Hash.length bytes set to zeros is used.
zh_cn: 如果给定的密钥不可用，则使用由设置为零的 Hash.length 字节串组成的 0 值。

source: If a higher version request is received, the proxy/gateway MUST either downgrade the request version, or respond with an error, or switch to tunnel behavior.
zh_cn: 如果收到更高版本的请求，代理/网关必须降级请求版本，或者响应错误，或切换到隧道行为。

source: If a match is found and the server is willing to establish the new connection using the specified session state, the server will respond with the same value as was supplied by the client.
zh_cn: 如果找到匹配且服务器愿意使用指定的会话状态建立新连接，则服务器将使用与客户端提供的值相同的值进行响应。
